<html>
<head>
<link rel="stylesheet" type="text/css" href="../../../css.css" />
<!--Meta und css-->
<title>Computer-Wiki</title>
<link rel="shortcut icon" href="../../../Images/favicon.ico"/>
</head>
<body>
<div id="container">
<div id="kopf"><img id="logo" style="vertical-align:middle" src="../../../images/logo.jpg"/></div>
<div id="mitte">
  <div id="inhalt">
	   <p><h1>Maus:</h1>
	   Die Maus, jeder kennt sie, mit einem Kabal oder &uuml;ber funk egal wie sie mit dem Computer verbunden ist, sie ist bei den meisten heutigen Computersystemen unumg&auml;nglich.
	   Doch ist die Entwicklungsgeschichte der Maus lang und ziemlich interressant. Dieser Text wird dir die Entwicklung der Maus darlegen.
	   </p></br>
       <p><h2>Geschichte</h2>
       Bereits am 2.Oktober 1968, ver&ouml;ffentlichte die deutsche Telefunken ein neuartiges Eingabeger&auml;t, das als "Rollkugel" bezeichnet wurde, allerdings nicht patentiert wurde, aber es war die erste Maus. 
       Doch im Dezember 1968 ver&ouml;ffentlichte das Entwickler Teams rund um Douglas C. Engelbart ihre Version einer Maus, obwohl man nicht genau sagen kann wer zuerst die Idee zu einer Maus hatte, ist die Firma Telefunken die erste, die M&auml;use kommerziell herstellte.</br>
       Das Problem war jedoch, dass zu dieser Zeit noch keine grafischen Benutzeroberfl&auml;chen existierten, deshalb wurde der Maus wenig Beachtung geschenkt. In den 70er Jahren des vergangenen Jahrhunderts erfolgte die Weiterentwicklung durch William English im Foschungszentrum Xerox PARC entwickelte er die erste Kugelmaus, diese wurde 1973 erstmals beim Xerox Alto eingesetzt, dieser Computer besa&szlig; auch erstmals eine grafische Benutzeroberfl&auml;che.</br>
       Niklas Wirth wurde durch die T&auml;tigkeit am PARC angeregt und entwickelte an der ETH Z&uuml;rich eine grafisch orientierte Workstation mit Mausbedienung, diese wurde 1980 worgestellt und wurde 1981 im Rechner Xerox Star eingestzt. leider wurde dieses System kein wirtschaftlicher Erfolg, da die Maus 400 Us-Dollar und die Schnittstelle im Computer 300 Us-Dollar kostete.</br>
       Apple beauftragte ein Design- und Ingenieurb&uuml;ro mit der Entlicklung einer verbesserten industriell hergestellten Maus f&uuml;r 25 Us-Dollar. Die entwickelte Kugelmaus wurde zum vorherrschenden Funktionsprinzip f&uuml;r M&auml;use der 80er und 90er Jahre. Die Maus wurde mit dem Computer Lisa 1983 ver&auml&ouml;ffentlicht, das System floppte. 1984 wurde der erste Macintosh eingef&uuml;hrt, dieser war erfolgreicher als der Vorg&auml;nger Lisa. Erstmals in der PC-Geschichte basierte die Mensch-Maschinen-Schnittstelle von Lisa auf dieser Maus, und zwar so exklusiv, dass der Computer ohne Maus praktisch nicht zu bedienen war.</br>
       1985 brachte die Firma Logitech, die erste populäre Drei-Tasten-Kugelmaus mit dem Namen LogiMouse C7 auf den Markt.</br>
       1987 wurde das PS/2-System von IBM vorgestellt.
       Seit 1991 sind kabellose Mäuse verfügbar, die über Funk mit dem Computer kommunizieren.
       1995 wurde das erste Maus mit Scrollrad durch die Firma genius vorgestellt.
       Die ersten optischen M&auml;use hatten ende der 90er Jahren ihren Durchbruch, auf Grund der g&uuml;nstigen und leistungsf&auml;higen Chips zur Bildbearbeitung. 
       Ab 1998 tauchten auch die ersten USB-M&auml;use auf, die &uuml;ber den 1996 im Wesentlichn von Intel spezifischen USB-Anschluss mit dem Computer verbunden und in Windows 95, Windows 98 oder MacOS auf Apple iMac betrieben werden konnten.   
       Seit 2002 K&ouml;nnen M&auml;use dank Microsoft und Logitech auch &uuml;ber Bluetooth mit dem Pc verbunden werden.
       </p>
       <p><h2>Funktion</h2>
       <h3>Mechanische Maus</h3>
        <p>Zentrales Element einer mechanischen Maus ist eine Kugel, die auf der Unterseite herausragt. Wird die Maus &uuml;ber eine ebene Oberfl&auml;che bewegt, dann dreht sich die Kugel mit. Im Innern der Maus befinden sich zwei Rollen, die im 90-Grad-Winkel zueinander angeordnet sind. Diese Rollen ber&uuml;hren die Kugel und drehen sich bei jeder Bewegung. Eine Rolle reagiert auf die seitlichen Bewegungen von links oder rechts. Die andere Rolle reagiert auf die Bewegungen von oben oder unten. Am Ende jeder Rolle befinden sich R&auml;dchen, die mit metallischen Speichen versehen sind. &Uuml;ber den Speichen sind jeweils zwei Metallkontakte befestigt, die bei jeder Bewegung elektrische Signale erzeugen. Aus den Signalen wird die Richtung der Bewegung, die Geschwindigkeit und Strecke ermittelt.<br>
        Bei einer anderen Art der mechanischen Maus treibt die Kugel kleine Wellen an, an denen Lochscheiben befestigt sind. Die Drehrichtung der Lochscheiben werden durch Lichtschranken abgefragt. Auch hier werden elektrische Signale erzeugt und Richtung, Geschwindigkeit und Strecke ermittelt.<br>
        Im Computer wird die Information f&uuml;r die Bewegung des Zeigers (Cursors) auf dem Bildschirm umgesetzt. Das Dr&uuml;cken der Maustasten l&ouml;st ebenfalls Signale aus, die an den Computer gesendet werden. Je nach Standort des Zeigers und Anzahl der Tastenbet&auml;tigungen (Mausklicks) wird eine Aktion ausgef&uuml;hrt.<br>
        Die mechanische Maus hat einen erheblichen Nachteil. Die Kugel transportiert Schmutz in das Innere, wodurch sich Ablagerungen an den Wellen bilden. Die m&uuml;ssen regelm&auml;&szlig;ig entfernt werden, sonst ruckelt der Cursor bei der Bedienung der Maus. Allerdings werden mechanische Computer-M&auml;use nicht mehr verwendet.</p>
        <h3>Trackball</h3>
        <p>Der Trackball ist ein Mausersatz und vom Prinzip her eine umgekehrte mechanische Maus. Statt unten, ragt die Kugel beim Trackball oben aus dem Geh&auml;use heraus. Die Kugel ist deutlich gr&ouml;&szlig;er und l&auml;sst sich mit dem Daumen oder mit den Fingern bewegen. Das Geh&auml;use selber bleibt auf dem Tisch liegen. Es wird nicht bewegt. Das ist bei geringem Platzbedarf ein gro&szlig;er Vorteil.</p>
        <h3>Optische Maus mit Standard-LED</h3>
        <p>Die erste Variante einer optischen Maus war eine absolute Innovation. Der Anteil der Mechanik nahm gegen&uuml;ber der mechanischen Maus ab. Die Kugel und die Laufwellen der mechanischen Maus haben immer wieder f&uuml;r Problem gesorgt.<br>
        Im Vergleich zur mechanischen Maus ist die optische Maus wartungsfrei. An der Stelle, wo in der mechanischen Maus die Kugel sitzt, befindet sich in der optischen Maus eine rote Leuchtdiode und ein Fototransistor (Sensor).<br>
        <br>
        Mit Hilfe dieser beiden Bauelemente tastet die Maus ein Raster auf der Unterlage ab. Die Maus erkennt dadurch die Bewegungsrichtung und die Geschwindigkeit der Bewegung. Diese Informationen werden an den Computer gesendet.<br>
        Auf sehr glatten, hellen oder spiegelnden Oberfl&auml;chen kann der Sensor aber kaum Bewegungsunterschiede messen. Hier funktioniert die Bewegungserkennung nicht richtig. Der Mauszeiger wackelt und zittert dann unkontrolliert auf dem Bildschirm herum. Aber die Elektronik in optischen M&auml;usen wurde &uuml;ber mehrere Jahre immer besser und stromsparender. So ist die Nutzung optischer M&auml;use heute absolut problemlos.</p>
        <h3>Optische Maus mit Laser-Diode</h3>
        <p>Stark spiegelnde Fl&auml;chen, wie Marmor und Glas, waren immer ein Problem f&uuml;r die optische Abtastelektronik. Deshalb richteten sich alle Weiterentwicklungen darauf, die Pr&auml;zision zu erh&ouml;hen und die Optik dahingehend zu verbessern, dass mehr Oberfl&auml;chen problemlos m&ouml;glich sind.<br>
        Mit einer Laser-Dioden wurde die Pr&auml;zision erheblich verbessert. Dabei nimmt ein angewinkelte Sensor das von der Oberfl&auml;che reflektierende Licht direkt auf. Doch durchsichtiges Glas und Spiegel sind auch f&uuml;r diese Technik immer noch ein Problem.</p>
        <h3>Optische Maus mit BlueTrack von Microsoft</h3>
        <p>Um die Pr&auml;zision noch weiter zu verbessern, entwickelte Microsoft eine Technik mit der Bezeichnung BlueTrack. Wie der Name schon sagt, stammt die h&ouml;here Pr&auml;zision von einer breit streuenden blauen LED. Zus&auml;tzlich arbeitet BlueTrack mit einer verbesserten Optik und &uuml;berarbeiteter Bildverarbeitung.<br>
        Mit BlueTrack funktionieren die M&auml;use auch auf Marmor, gemasertem Holz und sogar Teppichb&ouml;den.</p>
        <h3>Optische Maus mit Darkfield von Logitech</h3>
        <p>Als Spezialist f&uuml;r M&auml;use, Tastaturen und Joysticks ist Logitech mit seiner Technik Darkfield ganz vorn dabei. Diese Technik kommt mit praktisch allen Oberfl&auml;chen klar. Auch mit Glasplatten und spiegelnden Oberfl&auml;chen. Die Technik dahinter ist aus der Dunkelfeldmikroskopie bekannt. Daraus ist auch der Name Darkfield abgeleitet. Die Kunst bestand darin, diese Technik auf die Gr&ouml;&szlig;e einer Maus zu schrumpfen.<br>
        Und so funktionierts: Zwei unterschiedlich polarisierte LEDs im Infrarotbereich (850 nm) strahlen mit leichtem Versatz auf einen gemeinsamen Punkt. Dieser Punkt wird von einem dar&uuml;berliegenden Sensor aufgenommen. Ein Filter vor dem Sensor l&auml;sst nur die Infrarot-Frequenz durch. Die zweite LED wird allerdings nur bei Bedarf zugeschaltet.<br>
        Es gibt allerdings noch ein paar Einschr&auml;nkungen. Die Glasplatten m&uuml;ssen mindestens 4 mm dick sein. Und wenn das Glas zu sauber geputzt ist, dann bekommt der Sensor nicht genug Details zu sehen. Abhilfe schafft man, in dem man mit der Hand &uuml;ber die Oberfl&auml;che zu wischen. Fettfinger machen sich zwar optisch nicht gut, daf&uuml;r kommt der Sensor mit der so pr&auml;parierten besser Oberfl&auml;che klar.</p>
       
       </p> 
<!-- <p><table>        
		<tr>
        <th>Taste</th>
		<th>Bedeutung / Funktion</th>
		</tr>
		<tr>
		<td>linke Taste</td>
		<td>normaler Klick (Auswahl/Positionierung)</td>
		</tr>
		<tr>
		<td>mittlere Taste (oft auf Rad)</td>
		<td>Mittelklick</td>
		</tr>
		<tr>
		<td>rechte Taste</td>
		<td>Rechtsklick (meist Kontextmenü)</td>
		</tr>
		<tr>
		<td>Rad – hinauf</td>
		<td>meist Scroll-Up</td>
		</tr>
		<tr>
		<td>Rad – hinunter</td>
		<td>meist Scroll-Down</td>
		</tr>
		<tr>
		<td>Rad – Druck links</td>
		<td>meist Scroll-Left</td>
		</tr>
		<tr>
		<td>Rad – Druck rechts</td>
		<td>meist Scroll-Right</td>
		</tr>
		<tr>
		<td>seitlich links / oder linke untere Taste</td>
		<td>Sonderfunktion: z.&nbsp;B. Zurück im Browser</td>
		</tr>
		<tr>
		<td>seitlich rechts / oder linke obere Taste</td>
		<td>Sonderfunktion: z.&nbsp;B. Vorwärts im Browser</td>
		</tr>
</table></p>-->
       </p>
       <p>
       
       </p>
       <center><a href='javascript:scroll(0,0);'><img src="../../../Images/up.png" border="0" height="64" width="64" alt="Nach Hoch" /></a></center>
  </div>
  <div id="links">
	<ul>
		<li><a href="../../../index.html"><strong>Home</strong></a></li></br>
		<li><a href="../../Systems/Index_Systeme.html"><strong>Betriebssysteme</strong></a></li></br>
		<li><a href="../Komponenten.html"><strong>Komponenten</strong></a></li></br>
		<ul>
        <li><a href="#"><strong>Externe Ger&auml;te</strong></a></li></br>
        <ul>
        <li><a href="monitor.html"><strong>Monitor</strong></a></li>
        <li><a href="maus.html"><strong>Maus</strong></a></li>
        <li><a href="tastatur.html"><strong>Tastatur</strong></a></li>
        </ul>
        <li><a href="../interne_Teile/In_Per_Index.html"><strong>Interne Ger&auml;te</strong></a></li></br>
        </ul>
		<li><a href="../../History/History.html"><strong>Geschichte des Computers</strong></a></li></br>
	</ul>
  </div>
</div>
<div id="fuss"><a href="../../../Quellen.html"><strong>---Quellen---</strong></a></div>
</div>
</body>
</html>