<html>
<head>
<link rel="stylesheet" type="text/css" href="../../../css.css" />
<!--Meta und css-->
<title>Computer-Wiki</title>
<link rel="shortcut icon" href="../../../Images/favicon.ico"/>
</head>
<body>
<div id="container">
<div id="kopf"><img id="logo" style="vertical-align:middle" src="../../../images/logo.jpg"/></div>
<div id="mitte">
  <div id="inhalt">
  <p><h1>Tastatur</h1>
  </br>
  Die Tastatur, sie geh&ouml;rt zu den Peripheriegerät, und ist das &auml;lteste Eingabeger&auml;t f&uuml;r den Computer.</br>
  Doch wie arbeitet sie? Man muss sich unter der Tastatur ein System aus Zeilen und Spalten vorstellen, wenn also eine Taste gedr&uuml;ckt wird, so verbindet die stromleitende Platte unter den Tasten zwei Kontakte. Somit bekommt der Microcontroler der Tastatur das Signal, das in der Spalte x und Zeile y eine Taste gedr&uuml;ckt wurde, diese Information schickt der Controler an den Computer weiter.</br>
  Bei Mechhanischen Tastaturen, die vorallem in der Gaming-Scene sich gro&szlig;er Beliebtheit erfreuen, wird pro Taste ein kleiner Schalter vervendet, der das Siganal an den Microchip der Tastatur leitet, somit ist es einfacher eine defekte Taste zu reparieren, da man nur den Schalter austauschen muss.</br>
  Da du nun grob weist, wie so eine Tastatur die Signale verarbeitet, kommen wir nun zu den m&ouml;glichen &Uuml;bertragungs wegen, die genutzt werden, um die Signale an den Pc weiter zu leiten.</br>
  Es gibt zwei Wege, die heute noch weit verbreitet sind, zum einen ist es das von IBM entwickelte PS/2 Standart. Bei diesem System wird bei jedem dr&uuml;cken und loslassen ein Signal durch den Controler an den Pc gesendet, zudem wird gepr&uuml;ft, ob eine Funktionstaste (STRG, Alt, Alt Gr, usw.) gedr&uuml;ckt wurde. Diese Informationen werden dann in den Tastaturpuffer gespeichert und das Betriebsystem, dieses wandelt dann die Tastencodes in ein f&uuml;r das System erkannbares formnat um.</br>
  Zum anderen ist es die Verbindung &uuml;ber USB-Kabel, hierbei wird in bestimmten Abst&auml;nden ein Datenparket mit dem kompletten Status der Tastatur an den Pc gesendet.</br>
  USB-Tastaturen haben zudem Vorteile gegen&uuml;ber dem PS/2 Systemm, da man sie w&auml;hrend des laufenden Betriebs abschlie&szlig;en und wieder anschlie&szlig;en kann, man kann den Anschluss auch f&uuml;r andere Ger&auml;te nutzen und es k&ouml;nnen andere Ger&auml;te in das Geh&auml;use der Tastatur integriert werden, wie zum Beispiel ein Trackball, ein USB-Hub der ein Scrol-Rad.
  
  
  </p>
		</br>
	</br>
	</br>
	</br>
	</br>
	</br>
	</br>
	</br>
    </br>
  </div>
  <div id="links">
	<ul>
		<li><a href="../../../index.html"><strong>Home</strong></a></li></br>
		<li><a href="../../Systems/Index_Systeme.html"><strong>Betriebssysteme</strong></a></li></br>
		<li><a href="../Komponenten.html"><strong>Komponenten</strong></a></li></br>
		<ul>
        <li><a href="#"><strong>Externe Ger&auml;te</strong></a></li></br>
        <ul>
        <li><a href="monitor.html"><strong>Monitor</strong></a></li>
        <li><a href="maus.html"><strong>Maus</strong></a></li>
        <li><a href="tastatur.html"><strong>Tastatur</strong></a></li>
        </ul>
        <li><a href="../interne_Teile/In_Per_Index.html"><strong>Interne Ger&auml;te</strong></a></li></br>
        </ul>
		<li><a href="../../History/History.html"><strong>Geschichte des Computers</strong></a></li></br>
	</ul>
  </div>
</div>
<div id="fuss"><a href="../../../Quellen.html"><strong>---Quellen---</strong></a></div>
</div>
</body>
</html>