<html>
<head>
<link rel="stylesheet" type="text/css" href="../../../css.css" />
<!--Meta und css-->
<title>Computer-Wiki</title>
<link rel="shortcut icon" href="../../../Images/favicon.ico"/>
</head>
<body>
<div id="container">
<div id="kopf"><img id="logo" style="vertical-align:middle" src="../../../images/logo.jpg"/></div>
<div id="mitte">
  <div id="inhalt">
	<h1>Mainboard</h1>
	<p>Das Mainboard ( "<i>Hauptplatine</i>" oder "<i>Motherboard</i>"), ist die zentrale Platine eines Computers. Hauptprozessor (CPU), Speicher, der BIOS-Chip mit der integrierten Firmware, Schnittstellen-Bausteine und Steckpl&auml;tze f&uuml;r Erweiterungskarten sind darauf montiert. Die daf&uuml;r notwendigen Leiterbahnen sind auf mehrere Lagen (Layer) aufgeteilt.</p>
	<h2>Aufgaben</h2>
	<p>Die Hauptplatine beinhaltet Steckpl&auml;tze f&uuml;r den Prozessor, Speicherbausteine und Erweiterungskarten wie Grafik-, Sound- und Netzwerkkarten sowie Bausteine, die die Komponenten miteinander verbinden.Funktionen wie etwa der Speichercontroller sind mittlerweile in der CPU selbst integriert. Sound- und Netzkarten sind eigentlich ausnahmslos Standard und sind ausreichend f&uuml;r die meisten Benutzer. Onboard-Grafikkarten sind im Desktopbereich, anders als im Notebookbereich, eher selten. Prozessorhersteller bem&uuml;hen sich CPU und GPU wieder zu vereinen. Allen voran AMD nach der &Uuml;bernahme von ATI Technologies, die sowohl konkurrenzf&auml;hige Prozessoren als auch Grafikchips im Angebot haben und m&ouml;chten diese in der kommenden Fusion-Plattform wieder in ein Einzel-Chip-Design packen. Bereits heute ist ein Grafikkern in vielen Intel Core-i-Prozessoren sowie in AMDs Llano-APUs vorhanden. Integration auf die Hauptplatine gab es auch bei den Schnittstellen. W&auml;hrend fr&uuml;her selbst Standard-Anschl&uuml;sse wie die serielle ("RS-232") und parallele ("LPT") Schnittstelle nur &uuml;ber Steckkarten realisiert wurden, sind heute alle &uuml;blichen Ports schon auf der Hauptplatine vorhanden. Mehrere USB-Buchsen sind fester Bestandteil eines jeden I/O-Shields, ebenso PS/2-Schnittstellen f&uuml;r Maus und Tastatur (teils nur noch als Comboanschluss), die bereits erw&auml;hnten Audio- und Netzwerkanschl&uuml;sse, und, je nach Ausrichtung des Boards, Video-, eSATA, FireWire und andere Ports. Selten genutzte Ports m&uuml;ssen nicht selten auf Slotblenden umgelagert werden. Die ehemalige Vielfalt von verschiedenen Anschl&uuml;ssen f&uuml;r externe Komponenten ist heute v&ouml;llig verschwunden und durch USB ersetzt worden. Serial-ATA-Ports ("SATA") werden f&uuml;r interne Komponenten bereitgestellt. SATA ist mittlerweile ein Standard f&uuml;r Festplatten und optisch Laufwerke.  ATA/ATAPI ("PATA")-Schnittstellen sind, wenn &uuml;berhaupt, nur noch einmal vorhanden, w&auml;hrend fr&uuml;her zwei (Primary und Secondary) zum Anschluss von bis zu vier Laufwerken &uuml;blich waren. Floppy-Laufwerke sind heutzutage auch nur noch auf der H&auml;lfte aller Mainboards zu finden. Auch sie wurden durch Schnittstellen ersetzt. Bei den Steckpl&auml;tzen (engl. slots) f&uuml;r Erweiterungskarten verlief die Entwicklung vom XT-Bus &uuml;ber den ISA-Bus, den EISA-Bus, den PCI-Bus zum PCI-Express-Bus (PCIe). Im Serverbereich ist PCI-X noch aktuell. Der &Uuml;bergang zu PCIe wird allerdings bereits vollzogen. Steckpl&auml;tze werden nur noch dann benutzt, wenn besonders hohe Leistungen gefragt sind. All diese Karten besitzen eigene Prozessoren, die den Hauptprozessor des Systems entlasten und auf den jeweiligen Einsatzzweck optimiert sind. Externe Komponenten kann man, im Gegensatzt zu Onboard-Komponenten, ohne Datenverlust austauschen kann. W&auml;hrend aktuelle USB-3.0-Erweiterungskarten auf die hohe Datenrate von PCI-Express x1 oder h&ouml;her angewiesen sind.</p>
	<h2>Bauformen</h2>
	Das Format der Hauptplatinen wird nach dem Formfaktor unterschieden. Seit &uuml;ber zehn Jahren ist das ATX-Format aktuell. Es l&ouml;ste seinerzeit das AT-Format ab, was diverse Umstellungen an Geh&auml;usen, Netzteilen und Komponenten n&ouml;tig machte. Es existieren diverse Variationen von ATX und AT, um auch kompaktere Ger&auml;te ohne propriet&auml;re Formate best&uuml;cken zu k&ouml;nnen, etwa Baby AT oder &micro;ATX. Diese sind im Artikel Formfaktor (Computertechnik) aufgelistet.
    Das ATX-Format sollte ab 2003 durch das damit inkompatible BTX-Format abgel&ouml;st werden, BTX konnte sich aber nicht durchsetzen und wurde 2007 wieder vom Markt genommen.
    AMD hat au&szlig;erdem Anfang September 2007 das DTX-Format angek&uuml;ndigt, das f&uuml;r sparsame Benutzer gedacht ist, da es kleiner und au&szlig;erdem zum gr&ouml;&szlig;ten Teil ATX-kompatibel ist.
    
    <h3>Beispiel einer ATX-Hauptplatine (2010)</h3>
    <table border="1">
<caption>Komponenten einer Hauptplatine am Beispiel eines ATX-Boards von Asus aus dem Jahr 2010. Die Nummern beziehen sich auf die Abbildung.</caption>
<tr>
<th>Nummer</th>
<th>Komponente</th>
<th>Beschreibung</th>
</tr>
<tr>
<td>1</td>
<td>CPU-Sockel</td>
<td>Land Grid Array-Sockel, hier ein Sockel 1366 zur Montage eines Intel Core-i-Prozessors. Es ist kein Prozessor im Sockel und die Schutzkappe ist entfernt.</td>
</tr>
<tr>
<td>2</td>
<td>Chipsatz</td>
<td>Northbridge, ein Intel X58-Chipsatz (unter dem K&uuml;hlk&ouml;rper).</td>
</tr>
<tr>
<td>3</td>
<td>Chipsatz</td>
<td>Southbridge, ein Intel ICH10, mittels Heatpipe mit einem K&uuml;hlk&ouml;rper der Northbridge verbunden.</td>
</tr>
<tr>
<td>4</td>
<td>RAM-Steckpl&auml;tze</td>
<td>Steckpl&auml;tze f&uuml;r den Arbeitsspeicher, in diesem Fall f&uuml;r DDR3</td>
</tr>
<tr>
<td>5</td>
<td>PCI-Steckpl&auml;tze</td>
<td>F&uuml;r Erweiterungskarten.</td>
</tr>
<tr>
<td>6</td>
<td>PCI-Express-Steckpl&auml;tze</td>
<td>drei PCIe-x16-Slots (lang), sowie ein PCIe-x1-Slot (kurz). Der blaue (hier rechte, in &uuml;blicher Einbauanordnung obere) Slot ist f&uuml;r die Grafikkarte reserviert.</td>
</tr>
<tr>
<td>7</td>
<td>Jumper</td>
<td>Kleine Kurzschlussstecker zur Aktivierung oder Deaktivierung von Einstellungen (Hier: aufheben von Spannungslimit zum &uuml;bertakten).</td>
</tr>
<tr>
<td>8</td>
<td>Anschl&uuml;sse f&uuml;r Frontblende</td>
<td>Mit diesen werden Mainboard und Frontblende des Geh&auml;uses verbunden: Hauptschalter, Power-Anzeige (Ein/Standby), Laufwerkaktivit&auml;ts-Anzeige. Weiterhin, sofern vorhanden, Resetknopf und der eingebaute Lautsprecher.</td>
</tr>
<tr>
<td>9</td>
<td>24-poliger ATX-Connector</td>
<td>Die Hauptstromversorgung f&uuml;r die Hauptplatine durch das Netzteil. Bei einigen &auml;lteren Boards nur 20-polig, die meisten Netzteile sind aber mit Steckern ausger&uuml;stet, die beide Anschlusstypen unterst&uuml;tzen.</td>
</tr>
<tr>
<td>10</td>
<td>8-poliger ATX-Connector</td>
<td>Anschluss f&uuml;r die Stromversorgung der CPU. Bei &auml;lteren Boards oft nur 4-polig.</td>
</tr>
<tr>
<td>11</td>
<td>Externe Anschl&uuml;sse</td>
<td>Diese Anschl&uuml;sse ragen aus dem Geh&auml;use heraus und dienen als Anschluss f&uuml;r Peripherieger&auml;te wie Maus, Tastatur oder USB-Ger&auml;te und werden &uuml;ber das I/O Shield an das Geh&auml;use angepasst. Siehe unteres Bild.</td>
</tr>
<tr>
<td>12</td>
<td>Interne USB-Anschl&uuml;sse</td>
<td>&Uuml;ber diese werden z.&#160;B. USB-Anschl&uuml;sse an der Vorderseite des Geh&auml;uses oder ein eingebauter Speicherkartenleser mit dem Mainboard verbunden.</td>
</tr>
<tr>
<td>13</td>
<td>AAFP-Soundanschluss</td>
<td>An diesem Anschluss werden die Sound Ein- und Ausg&auml;nge des Frontpanels angeschlossen.</td>
</tr>
<tr>
<td>14</td>
<td>Serial-ATA-Anschl&uuml;sse</td>
<td>Erm&ouml;glicht die Verbindung von Festplatten oder optischen Laufwerken mit der Hauptplatine</td>
</tr>
<tr>
<td>15</td>
<td>IDE-Anschluss</td>
<td>Erm&ouml;glicht ebenfalls die Verbindung von Festplatten oder optischen Laufwerken mit dem Mainboard.</td>
</tr>
<tr>
<td>16</td>
<td>Floppy-Disk Stecker</td>
<td>Erm&ouml;glicht den Anschluss der Diskettenlaufwerke. Softwareseitig wird oft nur noch ein Laufwerk unterst&uuml;tzt.</td>
</tr>
</table>
<center><a href='javascript:scroll(0,0);'><img src="../../../Images/up.png" border="0" height="64" width="64" alt="Nach Hoch" /></a></center>
  </div>
  <div id="links">
	<ul>
		<li><a href="../../../index.html"><strong>Home</strong></a></li></br>
		<li><a href="../../Systems/Index_Systeme.html"><strong>Betriebssysteme</strong></a></li></br>
		<li><a href="../Komponenten.html"><strong>Komponenten</strong></a></li></br>
		<ul>
        <li><a href="../externe_Teile/Ex_Per_Index.html"><strong>Externe Ger&auml;te</strong></a></li></br>
        <li><a href="#"><strong>Interne Ger&auml;te</strong></a></li></br>
        <ul>
        <li><a href="arbeitsspeicher.html"><strong>Arbeitsspeicher</strong></a></li>
        <li><a href="cd-laufwerk.html"><strong>Cd-Laufwerk</strong></a></li>
        <li><a href="festplatte.html"><strong>Festplatte</strong></a></li>
        <li><a href="grafikkarte.html"><strong>Grafikkarte</strong></a></li>
        <li><a href="prozessor.html"><strong>Prozessor</strong></a></li>
        <li><a href="mainboard.html"><strong>Mainboard</strong></a></li>
        </ul>
        </ul>
		<li><a href="../../History/History.html"><strong>Geschichte des Computers</strong></a></li></br>
	</ul>
  </div>
        </div>
</div>
<div id="fuss">Meine F&uuml;&szml;e</div>
</div>
</body>
</html>